In [1]:
from assign_unique_ids_functions import *
import pandas as pd
pd.options.display.max_columns=99

In [2]:
df = pd.read_csv("../input/complaints-investigators_2000-2018_2018-03.csv.gz")

In [5]:
df.shape

(61235, 16)

In [6]:
df.columns

Index(['row_id', 'cr_id', 'current_star', 'gender', 'race', 'birth_year',
       'appointed_date', 'current_unit', 'investigator_type',
       'assigned_datetime', 'first_name', 'first_name_NS', 'last_name',
       'last_name_NS', 'middle_initial', 'suffix_name'],
      dtype='object')

In [17]:
dfu = df[["first_name", "last_name", "first_name_NS", "last_name_NS", 
          "middle_initial", "suffix_name", "birth_year", "race", "gender", 'appointed_date', 'current_unit']].drop_duplicates()
dfu.shape

(306, 11)

In [18]:
keep_duplicates(dfu, ["first_name", "last_name", "first_name_NS", "last_name_NS", 
          "middle_initial", "suffix_name", "birth_year", "race", "gender", "appointed_date"])

Empty DataFrame
Columns: [first_name, last_name, first_name_NS, last_name_NS, middle_initial, suffix_name, birth_year, race, gender, appointed_date, current_unit]
Index: []

In [27]:
id_cols = ["first_name", "last_name", "first_name_NS", "last_name_NS", 
          'birth_year', 'race', 'gender']
keep_duplicates(dfu, id_cols)

,first_name,last_name,first_name_NS,last_name_NS,middle_initial,middle_initial2,suffix_name,birth_year,race,gender
10571,BRIAN,HARRIS,BRIAN,HARRIS,L,NaN,NaN,1972.0,BLACK,MALE
58201,BRIAN,HARRIS,BRIAN,HARRIS,K,NaN,NaN,1972.0,BLACK,MALE
7625,CHARLES,WILLIAMS,CHARLES,WILLIAMS,M,NaN,NaN,1947.0,BLACK,MALE
78183,CHARLES,WILLIAMS,CHARLES,WILLIAMS,E,NaN,NaN,1947.0,BLACK,MALE
75927,JAMES,BANSLEY,JAMES,BANSLEY,A,NaN,NaN,1983.0,WHITE,MALE
86523,JAMES,BANSLEY,JAMES,BANSLEY,H,NaN,NaN,1983.0,WHITE,MALE
7345,WILLIAM,MURPHY,WILLIAM,MURPHY,T,NaN,NaN,1970.0,WHITE,MALE
62482,WILLIAM,MURPHY,WILLIAM,MURPHY,R,NaN,NaN,1970.0,WHITE,MALE

In [22]:
keep_duplicates(dfu, id_cols).to_csv('accused_possible_duplicates.csv')

In [23]:
id_cols = ["First.Name", "Last.Name", "Appointed.Date", "Birth.Year", "Race", "Gender"]
keep_duplicates(dfu, id_cols)

,First.Name,Last.Name,Middle.Initial,Suffix.Name,Appointed.Date,Birth.Year,Race,Gender,Current.Unit,Current.Star,Current.Rank
96278,JAMES,BANSLEY,NaN,NaN,2009-12-16,1983,WHITE,MALE,193,10927,PO
100055,JAMES,BANSLEY,NaN,NaN,2009-12-16,1983,WHITE,MALE,4,8791,PO
6912,JOSE,CHAMBERS,NaN,NaN,2000-01-24,1972,BLACK,MALE,-999,-999,PO
37058,JOSE,CHAMBERS,NaN,NaN,2000-01-24,1972,BLACK,MALE,2,4955,PO
2021,TIMOTHY,OBRIEN,P,NaN,1995-01-03,1967,WHITE,MALE,630,20899,DET
2637,TIMOTHY,OBRIEN,NaN,NaN,1995-01-03,1967,WHITE,MALE,630,21797,DET